#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
data.spectrocloud_cluster_profile.sc: Reading...
data.spectrocloud_cloudaccount_aws.default: Reading...
data.spectrocloud_registry.Bitnami_registry: Reading...
data.spectrocloud_registry.Bitnami_registry: Read complete after 0s [id=60971ef1dba15fc7f98ff1d2]
data.spectrocloud_pack_simple.redis_pack: Reading...
data.spectrocloud_cloudaccount_aws.default: Read complete after 0s [id=609c506e2bfeae8682408ffb]
data.spectrocloud_cluster_profile.sc: Read complete after 0s [id=62f2475e2a6ee9571745f89f]
module.tool-dev-1.spectrocloud_cluster_eks.this: Refreshing state... [id=64880d9c945edb47d0329d20]
data.spectrocloud_pack_simple.redis_pack: Read complete after 1s [id=646a6a3976c43529666c8cb3]
spectrocloud_cluster_profile.profile_resource: Refreshing state... [id=648813ee945edb5396ad0557]
spectrocloud_addon_deployment.depl: Refreshing state... [id=64880d9c945edb47d0329d20_648813ee945edb5396ad0557]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # spectrocloud_cluster_profile.profile_resource will be updated in-place
  ~ resource "spectrocloud_cluster_profile" "profile_resource" {
        id          = "648813ee945edb5396ad0557"
        name        = "addon-profile-1"
        # (5 unchanged attributes hidden)

      ~ pack {
            name         = "redis"
          ~ values       = <<-EOT
                pack:
                  namespace: "redis"
                  spectrocloud.com/install-priority: "230"
                  releaseNameOverride:
                    redis-service: redis-service-name
            EOT
            # (4 unchanged attributes hidden)
        }
    }

  # module.tool-dev-1.spectrocloud_cluster_eks.this will be updated in-place
  ~ resource "spectrocloud_cluster_eks" "this" {
        id               = "64880d9c945edb47d0329d20"
        name             = "tool-dev-1"
        tags             = []
        # (7 unchanged attributes hidden)

      ~ machine_pool {
            name              = "worker-basic"
            # (10 unchanged attributes hidden)

          - eks_launch_template {
              - root_volume_iops       = 0 -> null
              - root_volume_throughput = 0 -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.tool-dev-2.spectrocloud_cluster_eks.this will be created
  + resource "spectrocloud_cluster_eks" "this" {
      + cloud_account_id = "609c506e2bfeae8682408ffb"
      + cloud_config_id  = (known after apply)
      + context          = "project"
      + id               = (known after apply)
      + kubeconfig       = (known after apply)
      + location_config  = (known after apply)
      + name             = "tool-dev-2"
      + os_patch_on_boot = false
      + skip_completion  = false

      + cloud_config {
          + az_subnets      = {
              + "us-east-1a" = "subnet-07f0af093b8233990,subnet-080b9dc42d15b57a2"
              + "us-east-1b" = "subnet-0e0d96dc7ad3f02a5,subnet-025428faaddc4201f"
              + "us-east-1c" = "subnet-09e74165071ce03e6,subnet-0964e92baa663e495"
            }
          + endpoint_access = "public"
          + region          = "us-east-1"
          + vpc_id          = "vpc-0c9679602584608f9"
        }

      + cluster_profile {
          + id = "62f2475e2a6ee9571745f89f"
        }

      + machine_pool {
          + az_subnets      = {
              + "us-east-1a" = "subnet-07f0af093b8233990"
              + "us-east-1b" = "subnet-0e0d96dc7ad3f02a5"
              + "us-east-1c" = "subnet-09e74165071ce03e6"
            }
          + capacity_type   = "on-demand"
          + count           = 3
          + disk_size_gb    = 60
          + instance_type   = "t3.large"
          + name            = "worker-basic"
          + update_strategy = "RollingUpdateScaleOut"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `edison-ai`, Workflow: `Terraform Edison Plan`*